Информационная_база/src/DataProcessors/ЛБТ_АРМ/ЛБТ_АРМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЛБТ_АРМ</name>
  <attributes>
    <name>МасштабВнедрения</name>
    <type>
      <types>CatalogRef.ЛБТ_МасштабВнедрения</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.ЛБТ_НаправлениеДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.ЛБТ_Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ЛБТ_ШаблоныТиповЗадач</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Информационная_база/src/Catalogs/ЛБТ_ТипыЗадач/ЛБТ_ТипыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЛБТ_ТипыЗадач</name>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.ЛБТ_НаправлениеДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Нормочасы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Итого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ЛБТ_ШаблоныТиповЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Методика</name>
    <type>
      <types>CatalogRef.ЛБТ_МетодикаВнедрения</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.ЛБТ_НаправлениеДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>CatalogRef.ЛБТ_ТипыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеТипаЗадачи</name>
    <type>
      <types>CatalogRef.ЛБТ_НазванияТиповЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеСправочника</name>
    <attributes>
      <name>Нормочасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СодержаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Информационная_база/src/Catalogs/ЛБТ_ЗадачиАвтоматизации/ЛБТ_ЗадачиАвтоматизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЛБТ_ЗадачиАвтоматизации</name>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>CatalogRef.ЛБТ_НазванияТиповЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФункциональныйБлок</name>
    <type>
      <types>CatalogRef.ЛБТ_ФункциональныеБлоки</types>
    </type>
  </attributes>
  <attributes>
    <name>КонфигурацииСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Типовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Конфигурации</name>
    <attributes>
      <name>Конфигурация</name>
      <type>
        <types>CatalogRef.ЛБТ_Конфигурации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Информационная_база/src/DataProcessors/ЛБТ_АРМ/Forms/ФормаВыбораВидовРабот/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого стр из Параметры.ТЗДляПередачи Цикл
		стрТЗ = ТЗДляПередачи.Добавить();
		стрТЗ.Наименование = стр.Значение;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛБТ_ТипыЗадачДанныеСправочника.СодержаниеРабот КАК СодержаниеРабот
		|ИЗ
		|	Справочник.ЛБТ_ТипыЗадач.ДанныеСправочника КАК ЛБТ_ТипыЗадачДанныеСправочника
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛБТ_ЗадачиАвтоматизации КАК ЛБТ_ЗадачиАвтоматизации
		|		ПО ЛБТ_ТипыЗадачДанныеСправочника.Ссылка.НазваниеТипаЗадачи = ЛБТ_ЗадачиАвтоматизации.ТипОбъекта
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Шаблон <> ЛОЖЬ
		|				ТОГДА ЛБТ_ТипыЗадачДанныеСправочника.Ссылка.Шаблон = &Шаблон
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &Конфигурация <> ЛОЖЬ
		|				ТОГДА ЛБТ_ЗадачиАвтоматизации.Конфигурации.Конфигурация = &Конфигурация
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ЛБТ_ЗадачиАвтоматизации.ПометкаУдаления = ЛОЖЬ";
	
	Если ЗначениеЗаполнено(Параметры.Шаблон) Тогда
		Запрос.УстановитьПараметр("Шаблон",Параметры.Шаблон);
	Иначе
		Запрос.УстановитьПараметр("Шаблон",ЛОЖЬ);
		Сообщить("Шаблон не заполнен! Проект может быть рассчитан некорректно, заполните шаблон.");
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.Конфигурация) и Параметры.Конфигурация <> Справочники.ЛБТ_Конфигурации.НайтиПоНаименованию("Любая",истина) Тогда
		Запрос.УстановитьПараметр("Конфигурация",Параметры.Конфигурация);
	Иначе
		Запрос.УстановитьПараметр("Конфигурация",ЛОЖЬ);
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		стр = ТЗВидовЗадач.Добавить();
		Если ТЗДляПередачи.НайтиСтроки(Новый Структура("Наименование",ВыборкаДетальныеЗаписи.СодержаниеРабот)).Количество() > 0 Тогда
			стр.Флаг = ложь;
		Иначе
		стр.Флаг = истина;
		КонецЕсли;
		стр.Наименование = ВыборкаДетальныеЗаписи.СодержаниеРабот;
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	ВладелецФормы.ОбработатьВыборВидовЗадач(ТЗДляПередачи);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ФлагПриИзменении(Элемент)
	МассивСтрок = ТЗДляПередачи.НайтиСтроки(Новый Структура("Наименование",Элементы.ТЗВидовЗадач.ТекущиеДанные.Наименование));
	Если МассивСтрок.Количество() = 0 Тогда
		
		стрИскл = ТЗДляПередачи.Добавить();
		стрИскл.Наименование = Элементы.ТЗВидовЗадач.ТекущиеДанные.Наименование;
		
	Иначе
		
		Для каждого стр из МассивСтрок Цикл
			ТЗДляПередачи.Удалить(стр);
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры
